[command]/home/runner/work/_temp/b446b2a8-b565-4e39-8fc5-ffd957bd8a2f/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wiz-task-lambda-eu-central-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "terraform" = "true"
        }
      + tags_all              = {
          + "terraform" = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_policy_attachment_S3 will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment_S3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "wiz-task-lambda-eu-central-1"
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "API Gateway for Wiz Task"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "wiz-task-api-gateway-eu-central-1"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags                         = {
          + "terraform"             = "true"
          + "terraform-aws-modules" = "apigateway-v2"
        }
      + tags_all                     = {
          + "terraform"             = "true"
          + "terraform-aws-modules" = "apigateway-v2"
        }

      + cors_configuration {
          + allow_headers = [
              + "content-type",
            ]
          + allow_methods = [
              + "GET",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["GET /read"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["POST /write"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["GET /read"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /read"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["POST /write"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /write"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.this[0] will be created
  + resource "aws_apigatewayv2_stage" "this" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags          = {
          + "terraform" = "true"
        }
      + tags_all      = {
          + "terraform" = "true"
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 500
          + throttling_rate_limit    = 1000
        }

      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + route_key                = "GET /read"
          + throttling_burst_limit   = 500
          + throttling_rate_limit    = 1000
        }
      + route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = true
          + logging_level            = (known after apply)
          + route_key                = "POST /write"
          + throttling_burst_limit   = 500
          + throttling_rate_limit    = 1000
        }
    }

  # module.lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.lambda.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.lambda.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/wiz-task-lambda-eu-central-1"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "terraform" = "true"
        }
      + tags_all          = {
          + "terraform" = "true"
        }
    }

  # module.lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./outputs/main.zip"
      + function_name                  = "wiz-task-lambda-eu-central-1"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "kw87RqKU5xxHIxSRmgejm/of4fSRh5w46hnF9ivML7s="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "terraform"             = "true"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "terraform"             = "true"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)
        # (1 unchanged attribute hidden)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "wiz-task-bucket-eu-central-1"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wiz-task-lambda-eu-central-1"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGatewayPost"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wiz-task-lambda-eu-central-1"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "AllowExecutionFromAPIGatewayPost"
    }

  # module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wiz-task-lambda-eu-central-1"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "AllowExecutionFromAPIGateway"
    }

  # module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGatewayPost"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wiz-task-lambda-eu-central-1"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = "AllowExecutionFromAPIGatewayPost"
    }

  # module.s3_bucket.aws_s3_bucket.my_bucket will be created
  + resource "aws_s3_bucket" "my_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "wiz-task-bucket-eu-central-1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"      = "wiz-task-bucket-eu-central-1"
          + "terraform" = "true"
        }
      + tags_all                    = {
          + "Name"      = "wiz-task-bucket-eu-central-1"
          + "terraform" = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_bucket.aws_s3_bucket_policy.allow_lambda_access will be created
  + resource "aws_s3_bucket_policy" "allow_lambda_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gateway_endpoint = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role.lambda_role will be created%0A  + resource "aws_iam_role" "lambda_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "wiz-task-lambda-eu-central-1"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "terraform" = "true"%0A        }%0A      + tags_all              = {%0A          + "terraform" = "true"%0A        }%0A      + unique_id             = (known after apply)%0A%0A      + inline_policy (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.lambda_policy_attachment_S3 will be created%0A  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment_S3" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"%0A      + role       = "wiz-task-lambda-eu-central-1"%0A    }%0A%0A  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created%0A  + resource "aws_apigatewayv2_api" "this" {%0A      + api_endpoint                 = (known after apply)%0A      + api_key_selection_expression = "$request.header.x-api-key"%0A      + arn                          = (known after apply)%0A      + description                  = "API Gateway for Wiz Task"%0A      + execution_arn                = (known after apply)%0A      + id                           = (known after apply)%0A      + ip_address_type              = (known after apply)%0A      + name                         = "wiz-task-api-gateway-eu-central-1"%0A      + protocol_type                = "HTTP"%0A      + route_selection_expression   = "$request.method $request.path"%0A      + tags                         = {%0A          + "terraform"             = "true"%0A          + "terraform-aws-modules" = "apigateway-v2"%0A        }%0A      + tags_all                     = {%0A          + "terraform"             = "true"%0A          + "terraform-aws-modules" = "apigateway-v2"%0A        }%0A%0A      + cors_configuration {%0A          + allow_headers = [%0A              + "content-type",%0A            ]%0A          + allow_methods = [%0A              + "GET",%0A              + "POST",%0A            ]%0A          + allow_origins = [%0A              + "*",%0A            ]%0A        }%0A    }%0A%0A  # module.api_gateway.aws_apigatewayv2_integration.this["GET /read"] will be created%0A  + resource "aws_apigatewayv2_integration" "this" {%0A      + api_id                                    = (known after apply)%0A      + connection_type                           = "INTERNET"%0A      + id                                        = (known after apply)%0A      + integration_response_selection_expression = (known after apply)%0A      + integration_type                          = "AWS_PROXY"%0A      + integration_uri                           = (known after apply)%0A      + payload_format_version                    = "2.0"%0A      + timeout_milliseconds                      = (known after apply)%0A    }%0A%0A  # module.api_gateway.aws_apigatewayv2_integration.this["POST /write"] will be created%0A  + resource "aws_apigatewayv2_integration" "this" {%0A      + api_id                                    = (known after apply)%0A      + connection_type                           = "INTERNET"%0A      + id                                        = (known after apply)%0A      + integration_response_selection_expression = (known after apply)%0A      + integration_type                          = "AWS_PROXY"%0A      + integration_uri                           = (known after apply)%0A      + payload_format_version                    = "2.0"%0A      + timeout_milliseconds                      = (known after apply)%0A    }%0A%0A  # module.api_gateway.aws_apigatewayv2_route.this["GET /read"] will be created%0A  + resource "aws_apigatewayv2_route" "this" {%0A      + api_id             = (known after apply)%0A      + api_key_required   = false%0A      + authorization_type = "NONE"%0A      + id                 = (known after apply)%0A      + route_key          = "GET /read"%0A      + target             = (known after apply)%0A    }%0A%0A  # module.api_gateway.aws_apigatewayv2_route.this["POST /write"] will be created%0A  + resource "aws_apigatewayv2_route" "this" {%0A      + api_id             = (known after apply)%0A      + api_key_required   = false%0A      + authorization_type = "NONE"%0A      + id                 = (known after apply)%0A      + route_key          = "POST /write"%0A      + target             = (known after apply)%0A    }%0A%0A  # module.api_gateway.aws_apigatewayv2_stage.this[0] will be created%0A  + resource "aws_apigatewayv2_stage" "this" {%0A      + api_id        = (known after apply)%0A      + arn           = (known after apply)%0A      + auto_deploy   = true%0A      + deployment_id = (known after apply)%0A      + execution_arn = (known after apply)%0A      + id            = (known after apply)%0A      + invoke_url    = (known after apply)%0A      + name          = "$default"%0A      + tags          = {%0A          + "terraform" = "true"%0A        }%0A      + tags_all      = {%0A          + "terraform" = "true"%0A        }%0A%0A      + default_route_settings {%0A          + data_trace_enabled       = false%0A          + detailed_metrics_enabled = true%0A          + logging_level            = (known after apply)%0A          + throttling_burst_limit   = 500%0A          + throttling_rate_limit    = 1000%0A        }%0A%0A      + route_settings {%0A          + data_trace_enabled       = false%0A          + detailed_metrics_enabled = true%0A          + logging_level            = (known after apply)%0A          + route_key                = "GET /read"%0A          + throttling_burst_limit   = 500%0A          + throttling_rate_limit    = 1000%0A        }%0A      + route_settings {%0A          + data_trace_enabled       = false%0A          + detailed_metrics_enabled = true%0A          + logging_level            = (known after apply)%0A          + route_key                = "POST /write"%0A          + throttling_burst_limit   = 500%0A          + throttling_rate_limit    = 1000%0A        }%0A    }%0A%0A  # module.lambda.data.aws_caller_identity.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_caller_identity" "current" {%0A      + account_id = (known after apply)%0A      + arn        = (known after apply)%0A      + id         = (known after apply)%0A      + user_id    = (known after apply)%0A    }%0A%0A  # module.lambda.data.aws_partition.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.lambda.data.aws_region.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_region" "current" {%0A      + description = (known after apply)%0A      + endpoint    = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A    }%0A%0A  # module.lambda.aws_cloudwatch_log_group.lambda[0] will be created%0A  + resource "aws_cloudwatch_log_group" "lambda" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/lambda/wiz-task-lambda-eu-central-1"%0A      + name_prefix       = (known after apply)%0A      + retention_in_days = 0%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "terraform" = "true"%0A        }%0A      + tags_all          = {%0A          + "terraform" = "true"%0A        }%0A    }%0A%0A  # module.lambda.aws_lambda_function.this[0] will be created%0A  + resource "aws_lambda_function" "this" {%0A      + architectures                  = (known after apply)%0A      + arn                            = (known after apply)%0A      + code_sha256                    = (known after apply)%0A      + filename                       = "./outputs/main.zip"%0A      + function_name                  = "wiz-task-lambda-eu-central-1"%0A      + handler                        = "main.lambda_handler"%0A      + id                             = (known after apply)%0A      + invoke_arn                     = (known after apply)%0A      + last_modified                  = (known after apply)%0A      + memory_size                    = 128%0A      + package_type                   = "Zip"%0A      + publish                        = true%0A      + qualified_arn                  = (known after apply)%0A      + qualified_invoke_arn           = (known after apply)%0A      + reserved_concurrent_executions = -1%0A      + role                           = (known after apply)%0A      + runtime                        = "python3.11"%0A      + signing_job_arn                = (known after apply)%0A      + signing_profile_version_arn    = (known after apply)%0A      + skip_destroy                   = false%0A      + source_code_hash               = "kw87RqKU5xxHIxSRmgejm/of4fSRh5w46hnF9ivML7s="%0A      + source_code_size               = (known after apply)%0A      + tags                           = {%0A          + "terraform"             = "true"%0A          + "terraform-aws-modules" = "lambda"%0A        }%0A      + tags_all                       = {%0A          + "terraform"             = "true"%0A          + "terraform-aws-modules" = "lambda"%0A        }%0A      + timeout                        = 3%0A      + version                        = (known after apply)%0A        # (1 unchanged attribute hidden)%0A%0A      + environment {%0A          + variables = {%0A              + "BUCKET_NAME" = "wiz-task-bucket-eu-central-1"%0A            }%0A        }%0A%0A      + ephemeral_storage {%0A          + size = 512%0A        }%0A%0A      + logging_config (known after apply)%0A%0A      + tracing_config (known after apply)%0A    }%0A%0A  # module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGateway"] will be created%0A  + resource "aws_lambda_permission" "current_version_triggers" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "wiz-task-lambda-eu-central-1"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + qualifier           = (known after apply)%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = "AllowExecutionFromAPIGateway"%0A    }%0A%0A  # module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromAPIGatewayPost"] will be created%0A  + resource "aws_lambda_permission" "current_version_triggers" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "wiz-task-lambda-eu-central-1"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + qualifier           = (known after apply)%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = "AllowExecutionFromAPIGatewayPost"%0A    }%0A%0A  # module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGateway"] will be created%0A  + resource "aws_lambda_permission" "unqualified_alias_triggers" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "wiz-task-lambda-eu-central-1"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = "AllowExecutionFromAPIGateway"%0A    }%0A%0A  # module.lambda.aws_lambda_permission.unqualified_alias_triggers["AllowExecutionFromAPIGatewayPost"] will be created%0A  + resource "aws_lambda_permission" "unqualified_alias_triggers" {%0A      + action              = "lambda:InvokeFunction"%0A      + function_name       = "wiz-task-lambda-eu-central-1"%0A      + id                  = (known after apply)%0A      + principal           = "apigateway.amazonaws.com"%0A      + source_arn          = (known after apply)%0A      + statement_id        = (known after apply)%0A      + statement_id_prefix = "AllowExecutionFromAPIGatewayPost"%0A    }%0A%0A  # module.s3_bucket.aws_s3_bucket.my_bucket will be created%0A  + resource "aws_s3_bucket" "my_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "wiz-task-bucket-eu-central-1"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Name"      = "wiz-task-bucket-eu-central-1"%0A          + "terraform" = "true"%0A        }%0A      + tags_all                    = {%0A          + "Name"      = "wiz-task-bucket-eu-central-1"%0A          + "terraform" = "true"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # module.s3_bucket.aws_s3_bucket_policy.allow_lambda_access will be created%0A  + resource "aws_s3_bucket_policy" "allow_lambda_access" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0APlan: 16 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + gateway_endpoint = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0
